## 3.1 Importing a Data Set with the read_csv Function

In [6]:
#  2026
from math import *
for a in range(2, 1000):
  i = ceil( log2(a) )
  N = ceil(2783*i/8)
  if (N * 3845627) >= (11*1024*1024*1024):
    print(a, N * 3845627, 11*1024*1024*1024)
    break

257 12040658137 11811160064

In [3]:
#  2025
from math import *
a = 10 + 52 + 963
i = ceil( log2(a) )
print(a, i)

l = []

for n in range(2,1000):
  N = ceil(n*i/8)
  if (2000*N) <= (693*1024):
    # print(n, 2000*N, 693*1024)
    l.append(n)
max(l)

1025 11

257

In [2]:
import pandas as pd

In [3]:
# The two lines below are equivalent
pd.read_csv(filepath_or_buffer = "3-pokemon.csv")
pd.read_csv("3-pokemon.csv")

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [ ]:
pd.read_csv("pokemon.csv", index_col = "Pokemon")

                       Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]

In [8]:
type(pd.read_csv("3-pokemon.csv", index_col = "Pokemon"))

pandas.core.frame.DataFrame

In [15]:
df = pd.read_csv("3-pokemon.csv")
s = df["Type"]
s = df[ df.columns[1] ]
s

0      Grass / Poison
1      Grass / Poison
2      Grass / Poison
3                Fire
4                Fire
            ...
804      Rock / Steel
805      Fire / Ghost
806          Electric
807             Steel
808             Steel
Name: Type, Length: 809, dtype: object

In [17]:
for i in df.columns:
  print(i)

Pokemon
Type

In [44]:
pokemon = pd.read_csv(
    "3-pokemon.csv",
    index_col = "Pokemon"
)['Type']

In [18]:
pd.read_csv("3-google_stocks.csv").head()

         Date  Close
0  2004-08-19  49.98
1  2004-08-20  53.95
2  2004-08-23  54.50
3  2004-08-24  52.24
4  2004-08-25  52.80

In [23]:
pd.read_csv(
    "3-google_stocks.csv",
    parse_dates = ["Date"],
    index_col = "Date"
)['Close'].head()

Date
2004-08-19    49.98
2004-08-20    53.95
2004-08-23    54.50
2004-08-24    52.24
2004-08-25    52.80
Name: Close, dtype: float64

In [ ]:
pd.read_csv(
    "google_stocks.csv",
    parse_dates = ["Date"],
    index_col = "Date",
    squeeze = True
).head()

Date
2004-08-19    49.98
2004-08-20    53.95
2004-08-23    54.50
2004-08-24    52.24
2004-08-25    52.80
Name: Close, dtype: float64

In [36]:
google = pd.read_csv(
    "3-google_stocks.csv",
    parse_dates = ["Date"],
    index_col = "Date"
)['Close']
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [ ]:
pd.read_csv("revolutionary_war.csv").tail()

                         Battle  Start Date     State
227         Siege of Fort Henry   9/11/1782  Virginia
228  Grand Assault on Gibraltar   9/13/1782       NaN
229   Action of 18 October 1782  10/18/1782       NaN
230   Action of 6 December 1782   12/6/1782       NaN
231   Action of 22 January 1783   1/22/1783  Virginia

In [ ]:
pd.read_csv(
    "revolutionary_war.csv",
    index_col = "Start Date",
    parse_dates = ["Start Date"],
).tail()

                                Battle     State
Start Date
1782-09-11         Siege of Fort Henry  Virginia
1782-09-13  Grand Assault on Gibraltar       NaN
1782-10-18   Action of 18 October 1782       NaN
1782-12-06   Action of 6 December 1782       NaN
1783-01-22   Action of 22 January 1783  Virginia

In [25]:
pd.read_csv(
    "3-revolutionary_war.csv",
    index_col = "Start Date",
    parse_dates = ["Start Date"],
    usecols = ["State", "Start Date"]
)['State'].tail()

Start Date
1782-09-11    Virginia
1782-09-13         NaN
1782-10-18         NaN
1782-12-06         NaN
1783-01-22    Virginia
Name: State, dtype: object

In [28]:
battles = pd.read_csv(
    "3-revolutionary_war.csv",
    index_col = "Start Date",
    parse_dates = ["Start Date"],
    usecols = ["State", "Start Date"]
)['State']
battles

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

## 3.2 Sorting a Series

### 3.2.1 Sorting by Values with the sort_values Method

In [ ]:
google.sort_values()

Date
2004-09-03      49.82
2004-09-01      49.94
2004-08-19      49.98
2004-09-02      50.57
2004-09-07      50.60
               ...
2019-04-23    1264.55
2019-10-25    1265.13
2018-07-26    1268.33
2019-04-26    1272.18
2019-04-29    1287.58
Name: Close, Length: 3824, dtype: float64

In [ ]:
pokemon.sort_values()

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [ ]:
pd.Series(data = ["Adam", "adam", "Ben"]).sort_values()

0    Adam
2     Ben
1    adam
dtype: object

In [37]:
google.sort_values(ascending = False).head()

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [38]:
pokemon.sort_values(ascending = False).head()

NameError: name 'pokemon' is not defined

In [ ]:
# The two lines below are equivalent
battles.sort_values()
battles.sort_values(na_position = "last")

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [ ]:
battles.sort_values(na_position = "first")

Start Date
1775-09-17         NaN
1775-12-31         NaN
1776-03-03         NaN
1776-03-25         NaN
1776-05-18         NaN
                ...
1781-07-06    Virginia
1781-07-01    Virginia
1781-06-26    Virginia
1781-04-25    Virginia
1783-01-22    Virginia
Name: State, Length: 232, dtype: object

In [ ]:
battles.dropna().sort_values()

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1781-07-06       Virginia
1781-07-01       Virginia
1781-06-26       Virginia
1781-04-25       Virginia
1783-01-22       Virginia
Name: State, Length: 162, dtype: object

### 3.2.2 Sorting by Index with the sort_index Method

In [ ]:
# The two lines below are equivalent
pokemon.sort_index()
pokemon.sort_index(ascending = True)

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [ ]:
battles.sort_index()

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [29]:
battles.sort_index(na_position = "first").head()

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
Name: State, dtype: object

In [30]:
battles.sort_index(ascending = False).head()

Start Date
1783-01-22    Virginia
1782-12-06         NaN
1782-10-18         NaN
1782-09-13         NaN
1782-09-11    Virginia
Name: State, dtype: object

### 3.2.3 Retrieving the Smallest and Largest Values with the nsmallest and nlargest Methods

In [39]:
google.sort_values(ascending = False).head()

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [40]:
# The two lines below are
# equivalent
google.nlargest(n = 5)
google.nlargest()

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [41]:
# The two lines below are
# equivalent
google.nsmallest(n = 5)
google.nsmallest(5)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
Name: Close, dtype: float64

## 3.3 Overwriting a Series with the inplace Parameter

In [ ]:
battles.head(3)

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
Name: State, dtype: object

In [ ]:
battles.sort_values().head(3)

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
Name: State, dtype: object

In [ ]:
battles.head(3)

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
Name: State, dtype: object

In [ ]:
battles.head(3)

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
Name: State, dtype: object

In [ ]:
battles.sort_values(inplace = True)

In [ ]:
battles.head(3)

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
Name: State, dtype: object

## 3.4 Counting Values with the value_counts Method

In [ ]:
pokemon.head()

Pokemon
Bulbasaur     Grass / Poison
Ivysaur       Grass / Poison
Venusaur      Grass / Poison
Charmander              Fire
Charmeleon              Fire
Name: Type, dtype: object

In [46]:
pokemon.value_counts().head()

Type
Normal     65
Water      61
Grass      38
Psychic    35
Fire       30
Name: count, dtype: int64

In [ ]:
len(pokemon.value_counts())

159

In [ ]:
pokemon.nunique()

159

In [48]:
pokemon\
.value_counts(ascending = True)\
.head()

Type
Steel / Ground     1
Fire / Rock        1
Rock / Dark        1
Psychic / Grass    1
Fire / Steel       1
Name: count, dtype: int64

In [49]:
pokemon\
.value_counts(normalize = True)\
.head()

Type
Normal     0.080346
Water      0.075402
Grass      0.046972
Psychic    0.043263
Fire       0.037083
Name: proportion, dtype: float64

In [50]:
pokemon\
.value_counts(normalize = True)\
.head()\
.round(2)

Type
Normal     0.08
Water      0.08
Grass      0.05
Psychic    0.04
Fire       0.04
Name: proportion, dtype: float64

In [ ]:
pokemon.value_counts(normalize = True).head() * 100

Normal     8.034611
Water      7.540173
Grass      4.697157
Psychic    4.326329
Fire       3.708282
Name: Type, dtype: float64

In [ ]:
(pokemon.value_counts(normalize = True) * 100).round(2)

Normal                8.03
Water                 7.54
Grass                 4.70
Psychic               4.33
Fire                  3.71
                      ...
Fighting / Flying     0.12
Psychic / Fighting    0.12
Ground / Steel        0.12
Fighting / Ghost      0.12
Fighting / Dark       0.12
Name: Type, Length: 159, dtype: float64

In [ ]:
google.value_counts().head()

194.27    3
307.10    3
290.41    3
287.68    3
237.04    3
Name: Close, dtype: int64

In [ ]:
google.max()

1287.58

In [ ]:
google.min()

49.82

In [51]:
buckets = [0, 200, 400, 600, 800,\
           1000, 1200, 1400]
google.value_counts(bins = buckets)

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: count, dtype: int64

In [ ]:
google.value_counts(bins = buckets).sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [ ]:
google.value_counts(bins = buckets, sort = False)

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [52]:
google.value_counts(bins = 6)

(48.581, 256.113]      1204
(256.113, 462.407]     1104
(462.407, 668.7]        507
(668.7, 874.993]        380
(1081.287, 1287.58]     337
(874.993, 1081.287]     292
Name: count, dtype: int64

In [ ]:
battles.head()

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
Name: State, dtype: object

In [ ]:
battles.value_counts().head()

South Carolina    31
New York          28
New Jersey        24
Virginia          21
Massachusetts     11
Name: State, dtype: int64

In [53]:
battles\
.value_counts(dropna = False)\
.head()

State
NaN               70
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Name: count, dtype: int64

In [ ]:
battles.index

DatetimeIndex(['1781-09-06', '1779-07-05', '1777-04-27', '1777-09-03',
               '1777-05-17', '1779-09-10', '1779-09-07', '1780-03-02',
               '1778-06-30', '1781-01-07',
               ...
               '1782-05-06', '1782-05-25', '1782-05-28', '1782-07-01',
               '1782-07-06', '1782-08-08', '1782-08-25', '1782-09-13',
               '1782-10-18', '1782-12-06'],
              dtype='datetime64[ns]', name='Start Date', length=232, freq=None)

In [ ]:
battles.index.value_counts()

1782-01-11    2
1778-09-07    2
1780-05-25    2
1782-03-16    2
1781-09-13    2
             ..
1776-03-25    1
1782-08-08    1
1775-04-20    1
1776-10-11    1
1780-03-02    1
Name: Start Date, Length: 217, dtype: int64

## 3.5 Invoking a Function on Every Series Value with the apply Method

In [54]:
funcs = [len, max, min]

In [55]:
funcs = [len, max, min]

for current_func in funcs:
    print(current_func(google))

3824
1287.58
49.82

In [ ]:
round(99.2)

99

In [ ]:
round(99.49)

99

In [ ]:
round(99.5)

100

In [56]:
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [59]:
# The two lines below are
# equivalent
google.apply(func = round)
google.apply(round).head()

Date
2004-08-19    50
2004-08-20    54
2004-08-23    54
2004-08-24    52
2004-08-25    53
Name: Close, dtype: int64

In [60]:
google.round().head()

Date
2004-08-19    50.0
2004-08-20    54.0
2004-08-23    54.0
2004-08-24    52.0
2004-08-25    53.0
Name: Close, dtype: float64

In [61]:
def single_or_multi(pokemon_type):
    if "/" in pokemon_type:
        return "Multi"

    return "Single"

In [63]:
pokemon.apply(single_or_multi)\
.head()

Pokemon
Bulbasaur      Multi
Ivysaur        Multi
Venusaur       Multi
Charmander    Single
Charmeleon    Single
Name: Type, dtype: object

In [ ]:
pokemon.apply(single_or_multi).value_counts()

Multi     405
Single    404
Name: Type, dtype: int64

## 3.6 Coding Challenge

### 3.6.1 Problems

### 3.6.2 Solutions

In [64]:
import datetime as dt
today = dt.datetime(2020, 12, 26)
today.strftime("%A")

'Saturday'

In [69]:
today

datetime.datetime(2020, 12, 26, 0, 0)

In [ ]:
pd.read_csv("revolutionary_war.csv").head()

                              Battle  Start Date          State
0                       Powder Alarm    9/1/1774  Massachusetts
1  Storming of Fort William and Mary  12/14/1774  New Hampshire
2   Battles of Lexington and Concord   4/19/1775  Massachusetts
3                    Siege of Boston   4/19/1775  Massachusetts
4                 Gunpowder Incident   4/20/1775       Virginia

In [70]:
days_of_war = pd.read_csv(
    "3-revolutionary_war.csv",
    usecols = ["Start Date"],
    parse_dates = ["Start Date"])['Start Date']

days_of_war.head()

0   1774-09-01
1   1774-12-14
2   1775-04-19
3   1775-04-19
4   1775-04-20
Name: Start Date, dtype: datetime64[ns]

In [71]:
def day_of_week(date):
    return date.strftime("%A")

In [74]:
days_of_war\
.dropna()\
.apply(day_of_week)\
.head()

0     Thursday
1    Wednesday
2    Wednesday
3    Wednesday
4     Thursday
Name: Start Date, dtype: object

In [73]:
days_of_war\
.dropna()\
.apply(day_of_week)\
.value_counts()

Start Date
Saturday     39
Friday       39
Wednesday    32
Thursday     31
Sunday       31
Tuesday      29
Monday       27
Name: count, dtype: int64

## 3.7 Summary

In [75]:
from datetime import datetime as dt

first_strdate ='10.05.2025'
second_strdate='26-June-2005'
third_strdate ='5 Jan, 11'

first_date =dt.strptime(first_strdate,  '%d.%m.%Y')
second_date=dt.strptime(second_strdate, '%d-%B-%Y')
third_date =dt.strptime(third_strdate,  '%d %b, %y')

print(first_strdate, '->',  first_date)
print(second_strdate, '->', second_date)
print(third_strdate, '->',  third_date)

10.05.2025 -> 2025-05-10 00:00:00
26-June-2005 -> 2005-06-26 00:00:00
5 Jan, 11 -> 2011-01-05 00:00:00

In [89]:
from datetime import datetime as dt

time = dt.now()

print(time.strftime("%d"))
print(time.strftime("%A"), time.strftime("%w"))
print(time.strftime("%B"), time.strftime("%m"))
print(time.strftime("%Y"), time.strftime("%y"))
print(time.strftime("%H:%M:%S"), time.strftime("%X"))

print('Current time', format_of_time)

28
Sunday 0
September 09
2025 25
12:40:32 12:40:32
Current time 12:33

'09'